<html>
    <head>
        <title>Manual - DebateServer</title>  
        <script>
            function hasClass(element, cls) {
                return (' ' + element.className + ' ').indexOf(' ' + cls + ' ') > -1;
            }
            function table(parentLevel, parentId, root) {
                var toc = document.createElement('ul');
                var rootNodes = root.childNodes;
                var itemList = [];
                for (var i = 0; i < rootNodes.length; i++) {
                    if (hasClass(rootNodes[i], 'toc_item')) {
                        itemList.push(rootNodes[i]);
                    }
                }
                for (var i = 0; i < itemList.length; i++) {
                    var list_element = document.createElement('li');
                    var node = itemList[i];
                    var link = document.createElement('a');
                    var linkId = parentId + (i + 1);
                    var nodeId = node.id || 'link' + linkId;
                    var nodeTitle = document.createElement('h' + parentLevel);
                    var nodeRuler = document.createElement('hr');
                    nodeTitle.innerHTML = linkId + ' - ' + node.title;
                    link.innerHTML = linkId + ' ' + node.title;
                    link.href = '#' + nodeId;
                    node.id = nodeId;
                    node.insertBefore(nodeRuler, node.firstChild);
                    node.insertBefore(nodeTitle, node.firstChild);
                    link.style.display = 'block';
                    link.style.textDecoration = 'None';
                    link.style.fontSize = (150 - 20 * parentLevel) + '%';
                    list_element.appendChild(link);
                    list_element.appendChild(table(parentLevel + 1, linkId + '-', node));
                    toc.appendChild(list_element);
                }
                return toc;
            }
            function table_root(title) {
                var main = document.getElementById('main');
                var titleElement = document.createElement("h1");
                titleElement.innerHTML = title;
                main.insertBefore(table(1, '', main), main.firstChild);
                main.insertBefore(titleElement, main.firstChild);
            }
        </script>
    </head>
    <body>
        <div id="main" style="width: 80%; margin-left: auto; margin-right: auto;">
            <div class="toc_item" title="Primeros pasos">
                <div class="toc_item" title="Ideas b&aacute;sicas">
                    <p>El objetivo de este programa es reunir en una sola m&aacute;quina
                        todo el soporte inform&aacute;tico que requiere un torneo.</p>
                    <p>Por supuesto, los servicios deben estar disponibles en m&aacute;s de un lugar - en varias salas,
                        y en cada sala probablemente en varios dispositivos. La filosof&iacute;a del servidor de debate
                        es mantener todo lo m&aacute;s simple posible. Para ello, una m&aacute;quina central ejecuta
                        el servidor, y mientras este se encuentre en funcionamiento, cualquier dispositivo conectado
                        a su misma red podr&aacute; acceder a ella mediante un navegador web.</p>
                </div>
                <div class="toc_item" title="Instalaci&oacute;n">
                    <p>Tras extraer el programa en la carpeta correspondiente, para funcionar correctamente debe estar acompa&ntilde;ado de las carpetas &quot;etc&quot;, &quot;static&quot;, y &quot;lib&quot;.</p>

                    <p>El programa requiere la versi&oacute;n 8 de Java. Ha de ser ejecutado en la misma carpeta en la que se encuentra, o no ser&aacute; capaz de encontrar los archivos de configuraci&oacute;n en &quot;etc&quot; y &quot;static&quot;. Para esto hay dos opciones. Por un lado, se puede invocar directamente desde la l&iacute;nea de comando con</p>

                    <p style="text-align: center;">cd &quot;direccion\de\la\carpeta&quot;</p>

                    <p style="text-align: center;">java -jar DebateServer.jar</p>

                    <p>pero para no hacer necesaria la l&iacute;nea de comando, el programa viene acompa&ntilde;ado de un script llamado <i>run.bat</i> que har&aacute; esto mismo con tan s&oacute;lo hacer doble clic sobre &eacute;l.</p>

                    <p><b>Abrir DebateServer.jar directamente desde el explorador de archivos lo ejecutar&aacute; en la carpeta del usuario, y el programa no podr&aacute; encontrar los archivos de configuraci&oacute;n.</b></p>
                </div>
                <div class="toc_item" title="Archivos de configuraci&oacute;n">
                    <p>El programa usa cuatro archivos de configuraci&oacute;n, que se hallan en la carpeta &quot;etc&quot;.</p>

                    <p>El primero de ellos, <i>configuration.ini</i>, especifica los nombres de los otros tres. Resulta &uacute;til si uno quiere mantener diferentes configuraciones. Por ejemplo, si uno tiene dos archivos de idioma, <i>locale_english.xml</i> y <i>locale_galego.xml</i>, puede cambiar la configuraci&oacute;n del programa editando <i>configuration.ini</i> y sustituyendo</p>

                    <p style="text-align: center;">locale=locale_english.xml</p>

                    <p>por</p>

                    <p style="text-align: center;">locale=locale_galego.xml</p>

                    <p>El archivo <i>locale.xml</i> especifica el idioma del programa. Se puede editar o sustituir para cambiarlo, pero en general no hace falta preocuparse de &eacute;l.</p>

                    <p><i>options.xml</i> guarda la informaci&oacute;n relevante para el tipo de debate - en particular, los turnos y posturas. Es decir, una versi&oacute;n de este archivo puede tener la configuraci&oacute;n para debate acad&eacute;mico, y otra versi&oacute;n para BP.</p>

                    <p><i>session.xml</i> tiene la informaci&oacute;n respectiva a la sesi&oacute;n particular de debate. En &eacute;l han de figurar, por ejemplo, los nombres de los equipos y sus integrantes.</p>

                    <p>Todos estos archivos pueden ser editados con el Bloc de notas o cualquier utilidad equivalente. </p>
                </div>
            </div>
            <div class="toc_item" title="El servidor">
                <p>El servidor es el programa que alberga los datos y al que el resto de m&aacute;quinas se conectan v&iacute;a web. Es decir, para que el sistema funcione, <b>ha de estar ejecut&aacute;ndose</b>. La interfaz gr&aacute;fica del mismo ofrece la informaci&oacute;n relevante sobre las conexiones y permite ejercer un control directo sobre todas sus funciones.</p>

                <p>A continuaci&oacute;n se describen las funciones que ofrece cada parte de la interfaz.</p>
                <div class="toc_item" title="Contrase&ntilde;as">
                    <p>Obviamente, el servidor ser&iacute;a de poca utilidad si cualquier persona con un navegador tuviese acceso y la capacidad de modificar toda la informaci&oacute;n en el mismo. Para ello, al arrancar el programa solicitar&aacute; dos contrase&ntilde;as. La primera ha de ser suministrada a los jueces, y ser&aacute; requerida para enviar y modificar puntuaciones. La segunda es para los encargados del cron&oacute;metro, y ser&aacute; requerida para crear y controlar los cron&oacute;metros.</p>

                    <p><b>Las contrase&ntilde;as han de ser introducidas de nuevo en cada ejecuci&oacute;n.</b></p>
                </div>
                <div class="toc_item" title="Configuraci&oacute;n IP">
                    <p>La pieza clave del sistema es poder conectarse a la m&aacute;quina que ejecuta el programa desde cualquier otra. Para ello, necesitamos su <b>direcci&oacute;n IP</b>, que es el equivalente a una direcci&oacute;n postal en la web. El formato son 4 n&uacute;meros separados por puntos, al estilo 123.45.67.890, que identifican de manera &uacute;nica al ordenador en una red determinada.</p>

                    <p><b>En particular, esto quiere decir que no cualquier ordenador del mundo puede acceder al servidor.</b> S&oacute;lo los que se hallen en su misma red - si por ejemplo utilizamos la IP del adaptador WiFi, <b>s&oacute;lo otras m&aacute;quinas conectadas a la misma red WiFi podr&aacute;n encontrar esa direcci&oacute;n.</b></p>

                    <p>La primera pesta&ntilde;a nos ofrece esta informaci&oacute;n, d&aacute;ndonos todas las direcciones IP que se est&aacute;n utilizando en el momento de arrancar.</p>

                    <p>La primera deber&iacute;a ser 127.0.0.1, con un nombre parecido a &quot;loopback&quot; - esta <b>no</b> nos interesa. Es la que utiliza el ordenador para comunicarse consigo mismo - es decir, es la &uacute;nica m&aacute;quina en esta red.</p>

                    <p>Normalmente, una de las IPs ser&aacute; la de la conexi&oacute;n WiFi, incluyendo en el nombre algo como &quot;Wireless&quot; o &quot;WLAN&quot;. El n&uacute;mero ha de ser algo parecido a 192.168.xx.yy. Esta <b>s&iacute;</b> es la que nos interesa, si pretendemos que el resto de m&aacute;quinas se conecten a trav&eacute;s de la red WiFi.</p>

                    <p>La IP es la &uacute;nica informaci&oacute;n necesaria para &quot;conectarse&quot; al servidor, adem&aacute;s de las contrase&ntilde;as requeridas para modificar datos. En cualquier otro aparato de la misma red, s&oacute;lo tenemos que abrir un navegador y escribir la direcci&oacute;n IP en la barra de navegaci&oacute;n. Es decir, donde normalmente escribir&iacute;amos</p>

                    <p style="text-align: center;">www.pagina-web.com</p>

                    <p>escribimos la IP correspondiente, por ejemplo</p>

                    <p style="text-align: center;">192.168.12.34</p>

                    <p>y el navegador web nos mostrar&aacute; la pantalla de inicio.</p>

                    <p><b>La IP puede variar de ejecuci&oacute;n a ejecuci&oacute;n, y deber&iacute;a ser lo primero que comprobemos al arrancar el programa. </b></p>
                </div>
                <div class="toc_item" title="Panel de control">
                    <p>El resto de pesta&ntilde;as cumplen la funci&oacute;n de panel de control. En ellas podemos acceder directamente a todos los datos, y modificarlos.</p>

                    <p><b>El panel de control no requiere contrase&ntilde;a - su objetivo es, en parte, servir de control de emergencia, si el acceso web da alg&uacute;n problema. El ordenador que lo ejecuta debe bloquearse con contrase&ntilde;a para evitar que cualquier persona pueda manipularlo. </b></p>
                    <div class="toc_item" title="Cron&oacute;metros">
                        <p>En esta pesta&ntilde;a podemos ver todos los cron&oacute;metros creados y su estado actual. Adem&aacute;s, nos permite poner en marcha o parar el cron&oacute;metro seleccionado en la lista. Si es necesario, tambi&eacute;n se pueden eliminar los cron&oacute;metros desde aqu&iacute; - por ejemplo, si el dispositivo que cre&oacute; uno se ha apagado y no puede volver a acceder a &eacute;l.</p>
                    </div>
                </div>
            </div>
            <div class="toc_item" title="El cron&oacute;metro">
                <p>El cron&oacute;metro est&aacute; especialmente pensado para una sesi&oacute;n de debate. La informaci&oacute;n que muestra es la intervenci&oacute;n actual, su tiempo en cuenta atr&aacute;s, los equipos y su postura, y opcionalmente un cron&oacute;metro secundario - por ejemplo, para preguntas.</p>

                <p>La marcha del cron&oacute;metro se indica con una l&iacute;nea verde en torno al mismo. Cuando se cruza el tiempo l&iacute;mite, el fondo se vuelve rojo, y el cron&oacute;metro cuenta en negativo.</p>

                <p>Se puede acceder a los cron&oacute;metros desde la p&aacute;gina principal, o directamente yendo a</p>

                <p style="text-align: center;"><i>[direcci&oacute;n IP]</i>/chrono</p>
                <div class="toc_item" title="Crear y borrar un cron&oacute;metro">
                    <p>Para iniciar un cron&oacute;metro, seleccionamos &quot;Nuevo&quot; en la lista. A no ser que ya se haya hecho antes, en este momento hay que introducir la contrase&ntilde;a para el cron&oacute;metro que se especific&oacute; al iniciar el programa. La contrase&ntilde;a ha de ser introducida en el recuadro en blanco que aparece en el centro de la pantalla.</p>

                    <p>A continuaci&oacute;n, seleccionamos los dos equipos que participar&aacute;n. La postura de cada uno se puede cambiar m&aacute;s tarde, para poder esperar a que sea sorteada.</p>

                    <p><b>S&oacute;lo el dispositivo que cre&oacute; el cron&oacute;metro puede controlarlo y borrarlo desde la web. </b> Evidentemente, el prop&oacute;sito de esto es que distintos encargados del cron&oacute;metro no puedan interferir entre s&iacute; - pero tiene dos consecuencias importantes</p>

                    <ul> <li>El cron&oacute;metro ha de ser creado <b>desde el aparato con el que se va a controlar</b>, t&iacute;picamente un <i>smartphone</i> o <i>tablet</i>.</li> <li>Si el dispositivo que cre&oacute; un cron&oacute;metro se apaga, o si cierra la sesi&oacute;n del navegador, es imposible controlar o borrar el cron&oacute;metro v&iacute;a web. Es necesario ir al servidor y eliminarlo manualmente.</li> </ul>

                    <p>Una vez terminado el uso de un cron&oacute;metro, su creador puede borrarlo de la lista simplemente seleccionando &quot;Borrar&quot;. <b>Esta operaci&oacute;n es irreversible.</b></p>
                </div>
                <div class="toc_item" title="Control">
                    <p>Una vez iniciado un cron&oacute;metro, su creador <b>(y s&oacute;lo el creador)</b> puede elegir la opci&oacute;n &quot;Control&quot; en la lista. Adem&aacute;s de poner en marcha y parar los dos cron&oacute;metros, tambi&eacute;n dispone de un bot&oacute;n de &quot;<i>reset</i>&quot; para reiniciar el cron&oacute;metro principal. Este est&aacute; acompa&ntilde;ado de un recuadro editable con el tiempo al que se reinicia. Por defecto es el tiempo de la postura actual, pero puede ser cambiado - por ejemplo, para volver a empezar desde alg&uacute;n punto intermedio si se produce una interrupci&oacute;n en el debate.</p>

                    <p>La hoja de control tambi&eacute;n tiene un bot&oacute;n de &quot;Intercambio&quot;, que cambia las posturas de ambos equipos (A favor o En Contra). Debe ser utilizado para asignar las posturas correspondientes una vez realizado el sorteo.</p>

                    <p>El bot&oacute;n &quot;Siguiente&quot; termina el turno actual y pasa a la pr&oacute;xima intervenci&oacute;n, seg&uacute;n el orden normal del debate. Si por equivocaci&oacute;n u otro motivo es necesario volver atr&aacute;s, la hoja tambi&eacute;n ofrece una lista de todas las posturas. Al pulsar cualquiera de ellas, el cron&oacute;metro se reiniciar&aacute; con el tiempo correspondiente.</p>
                </div>
                <div class="toc_item" title="Ver un cron&oacute;metro">
                    <p><b>Cualquier</b> m&aacute;quina de la red puede ver <b>cualquier</b> cron&oacute;metro. De este modo, mientras se controla desde alg&uacute;n dispositivo m&oacute;vil, el cron&oacute;metro en s&iacute; se puede proyectar para el p&uacute;blico, ser mostrado en una pantalla para los debatientes, otra para los jueces, y si uno se siente generoso con los medios, en una pantalla externa para que el p&uacute;blico que llega tarde sepa cuando puede entrar.</p>

                    <p>Para conectarse, s&oacute;lo es necesario ir a la lista, en</p>

                    <p style="text-align: center;"><i>[direcci&oacute;n IP]</i>/chrono</p>

                    <p>y seleccionar &quot;Ver&quot; en el cron&oacute;metro que uno quiera consultar.</p>
                </div>
            </div>
        </div>
        <script>
            table_root("Manual DebateServer");
        </script>
    </body>
</html>
